<b>Pandas之数据重塑</b>

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.DataFrame({'name':['Linda','Jacker','Ken','Alice'],'age':[12,16,13,10],'city':['A','B','C','D']},columns = ['name','age','city'])
data

     name  age city
0   Linda   12    A
1  Jacker   16    B
2     Ken   13    C
3   Alice   10    D

<b>stack和unstack</b>

stack() 将列 “压缩” 为行的下级层次化索引  
unstack() stack 的逆操作——将层次化的行索引 “展开” 为列

In [3]:
stacked = data.stack()
stacked

0  name     Linda
   age         12
   city         A
1  name    Jacker
   age         16
   city         B
2  name       Ken
   age         13
   city         C
3  name     Alice
   age         10
   city         D
dtype: object

In [4]:
stacked.unstack()

     name age city
0   Linda  12    A
1  Jacker  16    B
2     Ken  13    C
3   Alice  10    D

<b>pivot</b>

pivot()可以实现数据框纵向、横向存储间的简单转换三个参数都应是来自 obj 的列名，或列对象。分别用于指定结果对象的 index、columns 和 values 属性。

In [5]:
data.pivot(index='city',columns='name',values='age')

name  Alice  Jacker   Ken  Linda
city
A       NaN     NaN   NaN   12.0
B       NaN    16.0   NaN    NaN
C       NaN     NaN  13.0    NaN
D      10.0     NaN   NaN    NaN

In [6]:
data.pivot_table(index='city',columns='name',values='age')

name  Alice  Jacker   Ken  Linda
city
A       NaN     NaN   NaN   12.0
B       NaN    16.0   NaN    NaN
C       NaN     NaN  13.0    NaN
D      10.0     NaN   NaN    NaN

<b>crosstab</b>

crosstab得到一个简单的群组频率交叉表。

In [7]:
pd.crosstab(data.name,data.age)

age     10  12  13  16
name
Alice    1   0   0   0
Jacker   0   0   0   1
Ken      0   0   1   0
Linda    0   1   0   0

In [8]:
a = np.array(['foo', 'foo', 'foo', 'foo', 'bar', 'bar','bar', 'bar', 'foo', 'foo', 'foo'])
b = np.array(['one', 'one', 'one', 'two', 'one', 'one','one', 'two', 'two', 'two', 'one'])
c = np.array(['dull', 'dull', 'shiny', 'dull', 'dull', 'shiny','shiny', 'dull', 'shiny', 'shiny', 'shiny'])

In [9]:
pd.crosstab(a, [b, c], rownames=['a'], colnames=['b', 'c'])

b    one        two
c   dull shiny dull shiny
a
bar    1     2    1     0
foo    2     2    1     2